package practiceAlishev.day1;

/**
 Вывести на экран слово "JAVA", в строку, чтобы оно повторилось 10 раз, используя цикл while
 */
public class Task1 {

    public static void main(String[] args) {
        int count=0;
        while (count<10){
            System.out.print("JAVA ");
            count++;
        }
    }
}
