package day1;

/**
 Вывести на экран слово "JAVA", в столбец, чтобы оно повторилось 10 раз, используя цикл for
 */
public class Task3 {

    public static void main(String[] args) {
        for(int i=0; i<10; i++){
            System.out.println("JAVA");
        }
    }
}
